package org.iwoss.coremmaw.util;

import java.util.Random;

public class NameGenerator {
    private static final Random RANDOM = new Random();

    private static final String[] MALE_NAMES = {
            "Ратибор", "Милослав", "Святополк", "Добрыня", "Пересвет", "Мстислав", "Борислав", "Воислав", "Всеволод", "Тихомир",
            "Радомир", "Любомир", "Ярополк", "Велимудр", "Бажен", "Белояр", "Богдан", "Бронислав", "Бурислав", "Вацлав",
            "Всеслав", "Вышеслав", "Горислав", "Градимир", "Далемир", "Добромир", "Ждан", "Златомир", "Изяслав", "Любим",
            "Мирослав", "Остромир", "Путислав", "Радим", "Радислав", "Ростислав", "Святогор", "Станислав", "Твердислав", "Храбр",
            "Яромир", "Микула", "Садко", "Илья", "Никита", "Доброслав", "Боян", "Ратмир", "Святослав", "Стоян", "Сергий", "Генгуслав",
            "Леонид", "Иван", "Данила", "Дораслав"
    };

    private static final String[] FEMALE_NAMES = {
            "Забава", "Любава", "Милослава", "Радмила", "Светлана", "Ярославна", "Борислава", "Велислава", "Горислава", "Дарина",
            "Доброгнева", "Ждана", "Звенислава", "Златоцвета", "Купава", "Лада", "Мирослава", "Мстислава", "Огнеслава", "Предслава",
            "Радосвета", "Ростислава", "Светозара", "Станислава", "Тихомира", "Цветана", "Ясиня", "Беляна", "Власта", "Всеслава",
            "Голуба", "Добромила", "Желя", "Зарина", "Истома", "Краса", "Лучезара", "Мила", "Неля", "Олеся", "Алена",
            "Рада", "Славяна", "Снежана", "Умила", "Чаяна", "Чернава", "Щедра", "Ярина", "Милаша", "Верхуслава"
    };

    public static String getRandomName(int gender) {
        if (gender == 0) { // Мужчина
            return MALE_NAMES[RANDOM.nextInt(MALE_NAMES.length)];
        } else { // Женщина
            return FEMALE_NAMES[RANDOM.nextInt(FEMALE_NAMES.length)];
        }
    }
}